//******************同音字库(常用) 不含多音词  多音词按其最原始的读法收录********************\\
//************A****************\\
var A   	=		['啊','阿','吖','嗄','锕','腌','醃',];
var Ai		=		['哎爱唉矮挨艾嗳哀癌碍埃捱暧嫒霭隘'];
var Ao		=		['奥','熬','傲','凹','澳','袄','嗷','敖','坳','拗','鳌','獒','岙','翱','骜','懊','螯','遨','鏊','鏖','媪',];
var An		=		['俺','按','安','暗','案','岸','氨','庵','胺','鞍','黯','谙','鹌'];
var Ang		=		['昂','盎','肮','卬'];


//************B****************\\
var Ba		=		['吧','把','爸','扒','八','巴','拔','罢','霸','捌','坝','疤','靶','芭','粑','魃',];
var Bai		=		['白','百','拜','摆','败','呗','掰','佰','柏','伯','栢',];
var Bao 	=		['包','报','宝','抱','爆','保','饱','薄','暴','堡','煲','豹','鲍','胞','曝','苞','葆','褒','刨','孢','剥','雹','鸨'];
var Ban		=		['半','班','办','版','搬','般','板','伴','拌','扮','斑','瓣','扳','斑','绊','姅'];
var Bang	=		['帮','棒','绑','榜','邦','磅','傍','膀','浜','蚌','梆','镑','谤','埲','蛖','牓'];
var Bei		=		['呗','被','背','北','倍','杯','备','贝','悲','辈','碑','蓓','卑','焙','悖','陂','狈','惫','碚','孛','邶','椑','棓',];
var Ben		=		['本','笨','奔','苯','犇','夲','贲','锛','夯','喯','畚',];
var Beng	=		['蹦','崩','泵','甭','绷','嘣','蚌','迸','埲','埲','塴',];
var Bo		=		['波','博','播','薄','拨','啵','伯','剥','柏','搏','卜','泊','勃','玻','驳','脖','钵','帛','渤','箔','膊','跛','舶','菠','钹','亳','礡','簸','擘'];
var Bu		=		['不','部','补','步','布','簿','捕','卜','埠','吥','卟','怖','哺','埔','踄'];
var Bi		=		['比','逼','笔','币','必','毕','闭','壁','碧','避','彼','臂','鼻','弊','毙','俾','璧','哔','蔽','鄙','敝','匕','痹','庇','弼','婢'];
var Bin		=		['斌','彬','宾','滨','鬓','槟','缤','镔','殡','濒','玢','膑','摈','髌','瑸','邠'];
var Bing	=		['病','并','冰','兵','饼','丙','炳','柄','秉','摒','禀'];
var Bie		=		['别','憋','瘪','鳖','莂','蹩','彆','徶','柭','柲','蛂','䠥'];

//**************C****************\\
var Ca		=		['擦','嚓'];
var Cai		=		['才','菜','猜','踩','彩','财','采','蔡','材','裁','睬','採','偲','婇'];
var Can		=		['蚕','惨','餐','残','参','灿','掺','璨','惭','粲','䅟','傪','儏','孱','朁'];
var Cang	=		['藏','仓','苍','舱','沧','伧','臧','蒼','倉','匨','玱','鸧','㵴'];
var Cao		=		['草','操','曹','槽','糙','肏','嘈','漕','屮','懆','襙','慅','慒'];
var Ce		=		['测','册','侧','策','厕','恻','夨','栅','厠','冊','憡','墄','拺','敇','畟','笧','㩍'];
var Cen		=		['岑','参','涔','汵','硶','笒','㞥','㻸','䤁','䨙'];
var Ceng	=		'层曾蹭噌曽嶒橧竲㣒';
var Ci		=		'词次此刺辞赐磁瓷慈雌茨呲祠兹疵伺糍刾嬨垐螆柌栨朿茦㠿';
var Cu		=		'粗醋促簇蹙猝蔟殂卒蹴麤徂酢瘄憱噈怚橻趗蹵鼀';
var Cui		=		'催崔脆翠摧摧粹粹淬啐璀悴毳瘁';
var Cuo		=		['错搓挫措撮锉厝磋矬蹉鹾痤剉剒'];
var Cun		=		['存村寸吋皴邨忖籿侟蹲刌拵澊竴踆'];
var Cuan	=		['窜攒蹿篡汆撺熶躥䆘䞼'];
var Cha		=		['茶查差插叉茬察岔搽檫碴刹槎嚓锸䶪'];
var Chan	=		['产馋缠铲禅蝉掺颤婵搀蟾谗阐潺忏浐'];
var Chang	=		['尝唱长娼昶怅猖苌鲳伥敞嫦倡场常厂昌肠畅偿'];
var Chai	=		['拆柴差钗豺祡犲侪喍肞瘥芆虿蠆'];
var Chao	=		['吵超抄炒朝潮巢嘲钞晁焯巣剿摷仯鼌'];
var Chu		=		['出处除初楚触储厨畜褚厨杵橱础怵楮矗滁刍绌黜'];
var Chun	=		['纯春蠢唇醇淳椿莼鹑'];
var Chuan	=		['川穿传船串喘钏舛椽氚遄僢剶舡舩'];
var Chuang	=		['床创窗闯疮幢怆'];
var Chuo	=		['戳龊绰辍啜踔淖婥吷哾娕娖婼擉惙㲋'];
var Cong	=		['从葱聪聪匆琮囱苁淙枞孮'];
var Chong	=		['冲充重虫宠崇翀舂铳蟲憧忡茺漴艟'];
var Chou	=		'抽臭丑愁仇雠瞅筹稠酬绸畴惆踌';

//************************D****************************\\
var Da		=		['大哒打达答搭嗒妲撘耷笪沓汏跶怛瘩咑鞑匒垯'];
var Dao		=		['到道倒刀盗岛导捣稻叨蹈悼祷'];
var Dai		=		['带代呆戴待袋贷逮歹黛岱怠呔埭殆傣玳迨柋骀'];
var Dan		=		['丹但单蛋淡胆弹担旦氮诞啖耽掸'];
var Dang	=		['当荡档党挡裆铛氹凼宕砀'];
var De		=		['得的德嘚㤫'];
var Deng	=		['等登灯邓瞪蹬凳噔澄櫈镫'];
var Di		=		['滴地第低弟迪帝抵递敌睇蒂娣狄笛堤嘀谛涤荻棣缔翟嫡砥'];
var Dia		=		['嗲'];
var Die		=		['爹跌碟叠蝶谍迭喋牒昳耋'];
var Du		=		['度读毒赌堵杜都独肚渡嘟督镀睹笃妒渎犊獨牍蠹'];
var Duo		=		['多躲朵夺剁哆舵跺堕铎垛踱惰哚掇朶咄'];
var Duan	=		['端段短断锻缎煅椴偳剬媏毈煆碫'];
var Dui		=		['对队堆兑怼対碓'];
var Dong	=		['冬懂动东洞冻栋董侗硐氡垌苳峒胨烔'];
var Dou		=		['都斗逗豆抖豆兜痘窦陡蔸荳蚪'];

//***************************E***************************\\
var E		=		['额饿恶呃俄鹅娥厄鄂莪讹蛾屙娿扼峨鳄额颚噩萼腭遏婀轭鹗垩'];
var Ei		=		['诶欸'];
var En		=		['恩嗯摁蒽奀峎煾䅰䊐'];

//**************************F************************\\
var Fa		=		['发法罚伐阀乏筏髪發珐垡佱琺'];
var Fan		=		['饭烦反翻番犯范凡返帆樊泛繁梵贩幡藩钒藩矾蕃'];
var Fang	=		['房方放芳防仿坊访纺妨舫昉枋彷肪邡枋牥'];
var Fei		=		['费飞非肥废菲吠肺妃匪斐霏沸啡绯扉翡腓狒淝蜚诽悱'];
var Fen		=		['分份粉芬粪坟奋愤分焚纷酚汾氛忿吩妢弅岎朆'];
var Feng	=		['风疯封峰凤冯逢丰锋逢缝枫蜂奉沣烽讽峯俸酆'];
var Fo		=		['佛仏仸坲梻㤇'];
var Fu		=		['付服福副富负夫妇复附符扶府父浮幅傅伏赴敷腐腹辅弗甫肤赋芙覆氟阜斧孚抚俯馥拂缚孵釜辐腑'];

//*****************************G***********************\\
var Ga		=		['噶嘎咖尕伽尬尜呷旮戛'];
var Gai		=		['该改盖概钙丐溉垓赅姟垓'];
var Gao		=		['高搞告稿膏糕郜皋羔篙睾镐杲诰槁缟槔'];
var Gan		=		['干肝敢感赶甘杆咁赣竿淦柑擀苷矸尴秆酐橄'];
var Gang	=		['刚港钢岗杠缸纲冈肛罡戆冮㧏㭎牨'];
var Ge		=		['个哥各歌格隔割咯葛革阁戈搁鸽铬嗝舸蛤圪胳疙骼'];
var Gen		=		['跟根艮哏亘茛'];
var Geng	=		['更耿梗庚耕羹哽埂赓刯峺掶菮'];
var Gu		=		['古顾股骨故谷姑鼓估固孤雇菇箍蛊咕钴沽毂牯榖汩鸪觚'];
var Gua		=		['挂瓜卦刮寡呱褂剐啩'];
var Guan	=		['管关官馆观灌惯冠罐贯莞棺倌掼鹳盥泴'];
var Guang	=		['光逛广咣胱広洸犷桄'];
var Gui		=		['贵鬼归桂柜龟跪规轨硅圭瑰攰闺诡癸鲑珪刽亀簋桧晷'];
var Gun		=		['滚棍衮辊磙鲧惃裷'];
var Guo		=		['果过国郭锅裹菓帼粿虢猓掴蝈聒腘'];
var Gou		=		['狗够购沟勾钩构苟垢枸媾缑芶篝抅'];
var Gong	=		['公共供功工宫攻弓龚拱贡恭巩汞躬蚣'];

//**********************H***************************\\
var Ha		=		['哈蛤铪'];
var Hai		=		['还嗨孩海害咳亥骇骸'];
var Hao		=		['好号浩耗豪昊郝皓嚎毫灏蒿蚝壕濠颢嗥'];
var Han		=		['喊汗含汉韩寒函涵焊憨翰旱晗瀚憾悍菡酣邯'];
var Hang	=		['行航杭夯吭'];
var Hong	=		['红哄宏洪鸿虹弘轰泓烘薨'];
var He		=		['和喝呵合何盒河核贺鹤荷禾赫嗬褐颌涸壑'];
var Hen		=		['很恨狠痕噷拫鞎'];
var Heng	=		['哼横恒亨衡珩蘅'];
var Hu		=		['胡户湖虎护沪呼乎互糊壶忽狐弧瑚蝴葫唬浒槲扈斛醐鹘琥囫鹄'];
var Hua		=		['话花华画化滑划哗桦骅猾'];
var Huan	=		['换环患欢缓幻焕唤桓寰浣奂宦涣豢'];
var Huang	=		['黄慌晃皇荒谎煌凰恍惶蝗簧幌磺蟥璜湟遑徨隍'];
var Huo		=		['或活火货获霍祸伙豁惑'];
var Hun		=		['混婚魂昏荤浑阍珲诨馄溷'];

//************************J*******************************\\
var Ji		=		['几及级即既记极机鸡集基季急吉计己寄挤积继激籍姬祭羁脊疾寂霁骥忌'];
var Jia		=		['家加假架价佳嫁甲嘉继贾伽稼郏'];
var Jian	=		['剪见件间建贱剑减捡健鉴茧柬涧'];
var Jiang	=		['将蒋讲江奖降姜酱浆疆僵匠桨犟缰绛豇'];
var Jiao	=		['叫较脚教交角胶焦椒娇矫浇嚼搅饺蕉礁蛟骄郊窖轿狡酵'];
var Jie		=		['届姐接街节借杰皆结界戒洁解截介捷劫揭阶婕芥睫竭孑羯桀秸'];
var Jin		=		['进近金仅尽斤紧今劲锦禁津筋晋浸巾谨妗矜觐瑾襟靳'];
var Jing	=		['京经静净精景竟惊井镜晶敬警竞境颈靖荆径菁婧鲸睛泾腈璟粳痉兢劲阱憬胫'];
var Jiong	=		['囧炯窘炅扃冋迥'];
var Ju		=		['句据局具剧距居聚巨举菊拒橘桔惧锯鞠驹掬炬矩狙疽俱莒'];
var Jun		=		['均军君俊菌骏郡峻钧筠珺龟竣浚捃皲麇隽'];
var Juan	=		['绢圈眷隽倦娟捐卷劵鹃鄄涓狷蠲'];


var Ka		=		['卡喀咔咯咖佧呿'];
var Kai		=		['开凯楷恺铠慨锴揩剀'];
var Kan		=		['看砍坎刊侃堪阚槛勘瞰龛冚磡衎'];
var Kao		=		['靠考烤拷尻铐犒栲嵪'];
var Kang	=		['抗康扛炕亢糠慷钪伉槺匟嫝'];
var Ke		=		['可课克科客颗刻壳渴棵柯咳磕珂苛轲坷恪氪岢'];
var Ken		=		['肯啃恳垦'];
var Keng	=		['坑吭铿阬劥坈妔'];
var Kou		=		['口扣抠寇叩蔻筘'];
var Kong	=		['空孔控恐崆箜'];
var Ku		=		['库哭苦酷裤枯窟骷堀'];
var Kun		=		['困坤昆琨捆堃锟鲲睏'];
var Kua		=		['夸跨垮挎胯侉恗'];
var Kuai	=		['快块筷侩蒯脍郐'];
var Kuan	=		['款宽髋'];
var Kuang	=		['狂框矿况旷匡筐邝诳诓眶哐圹'];

var La		=		['啦拉辣蜡腊喇垃剌旯邋'];
var Lai		=		['来赖莱濑籁癞涞睐徕'];
var Lao		=		['捞老劳牢佬唠姥烙涝酪'];
var Lan		=		['懒蓝烂兰栏拦岚揽篮澜览滥澜缆榄'];
var Lang	=		['浪狼郎朗廊螂琅啷榔阆'];
var Le		=		['了乐勒嘞叻'];
var Lei		=		['类嘞累雷蕾泪磊垒肋擂耒镭儡'];
var Leng	=		['冷楞愣棱堎塄稜崚'];
var Li		=		['里李哩梨黎丽莉理离力利礼例粒历励栗励立厉厘狸俐俪荔璃犁笠郦隶吏鲤骊砾砺蠡鹂栎莅醴雳麗痢傈'];
var Lia		=		['俩'];
var Lian	=		['连脸练恋联莲链炼怜帘廉敛涟帘'];
var Liang	=		['梁亮两辆量凉良靓粮晾谅粱'];
var Lou		=		['楼喽漏露搂娄篓陋篓髅'];
var Long	=		['龙隆笼拢聋珑陇垄窿胧'];
var Lu		=		['路璐录露陆鲁卢鹿露炉撸禄卤芦噜泸潞掳庐泸鹭颅戮'];
var Lun		=		['论轮伦仑抡纶沦囵'];
var Luo		=		['罗洛落裸络咯骆螺啰萝摞锣珞烙箩骡雒逻'];
var Luan	=		['乱卵栾鸾峦銮挛娈孪'];
var Lv		=		'绿率吕驴旅铝律虑滤侣氯屡缕履捋';

var Ma		=		['吗嘛妈马码骂麻玛'];
var Mai		=		['买卖麦卖迈脉埋霾'];
var Mao		=		['毛猫冒帽茂貌冇矛贸茅锚懋髦'];
var Man		=		['慢满蛮曼漫瞒蔓嫚馒幔鳗螨僈'];
var Mang	=		['忙盲芒莽茫氓蟒邙牤尨硭'];
var Me		=		['么麽嚒'];
var Mei		=		['美没枚妹每煤梅霉眉媚媒魅'];
var Men		=		['们门闷焖扪'];
var Meng	=		['梦猛蒙萌孟盟懵锰朦艋檬勐濛蜢'];
var Mi		=		['米迷密咪蜜眯秘谜觅弥幂靡糜泌醚宓谧'];
var Mian	=		['面免棉眠绵勉冕缅娩沔偭麺'];
var Miao	=		'秒苗妙庙瞄喵淼描缪渺邈藐';
var Min		=		['民敏闵闽旻珉皿抿泯岷慜黾'];
var Ming	=		['名明铭命鸣冥茗溟暝瞑'];
var Mo		=		['摸莫陌磨墨魔末膜模抹摩默沫漠'];
var Mou		=		['某谋牟眸哞'];
var Mu		=		['木模母目亩幕牧墓穆姆慕暮沐牡募睦拇苜霂'];
var Miu		=		'谬缪';

var Na		=		['那呐哪拿娜纳钠衲吶'];
var Nai		=		['奶耐乃奈萘艿鼐'];
var Nan		=		['男南难楠喃囡腩囝赧'];
var Nang	=		['囊馕囔'];
var Nao		=		['闹脑挠恼孬瑙淖'];
var Ne		=		['呢'];
var Nei		=		['内馁娞'];
var Nen		=		['嫩恁'];
var Neng	=		['能螚竜'];
var Ni		=		['你尼腻拟泥妮倪逆匿昵霓溺'];
var Nin		=		['您'];
var Ning	=		['宁拧凝柠咛狞甯佞聍'];
var Nian	=		['年念粘黏撵捻蔫碾廿拈惗'];
var Niang	=		['娘酿'];
var Nie		=		['捏聂涅孽蹑镊'];
var Niu		=		['牛妞扭钮纽拗'];
var Nong	=		['弄农浓侬脓哝'];
var Nu		=		['怒奴弩努驽孥胬伮'];
var Nuo		=		['诺挪喏糯懦傩'];
var Nuan	=		['暖'];


var O		=		['哦噢喔'];
var Ou		=		['偶欧呕藕殴鸥瓯耦怄讴'];

var Pa		=		['怕爬趴啪帕扒耙葩杷琶'];
var Pai		=		['拍牌排派湃徘'];
var Pan		=		['盘潘攀盼判畔叛磐泮'];
var Pang	=		['胖旁胖逄膀磅螃彷'];
var Pao		=		['跑泡炮抛刨袍疱咆庖狍'];
var Pen		=		['喷盆湓'];
var Peng	=		['碰鹏彭朋捧棚蓬砰嘭澎烹篷'];
var Pi		=		['批屁皮劈匹披脾啤疲痞辟坯癖丕僻陂毗霹'];
var Pin		=		['品拼频贫聘嫔姘榀颦蘋'];
var Pian	=		['骗片篇偏便翩'];
var Piao	=		'票飘漂嫖瞟朴瓢缥';
var Ping	=		['平瓶凭屏评萍坪苹娉乒'];
var Po		=		['破婆坡泼颇迫魄泊珀陂粕鄱'];
var Pu		=		['铺普谱扑浦蒲噗仆璞埔葡圃濮脯瀑菩蹼'];


var Qi		=		['起其器气七期齐骑奇琪琦启旗棋漆妻弃柒企汽戚岂祁欺祺泣淇绮岐崎祈栖麒亓骐歧凄'];
var Qia		=		['掐恰卡洽'];
var Qian	=		['钱前愆千欠签浅牵倩迁潜茜仟谦铅歉芊阡骞黔'];
var Qiang	=		['强抢枪墙呛腔蔷羌羟锵'];
var Qiao	=		['桥巧敲瞧乔翘俏撬侨窍悄壳樵鞘荞'];
var Qie		=		['切且妾窃茄怯惬'];
var Qiu		=		['秋邱求球丘糗裘囚鳅虬酋'];
var Qiong	=		['穷琼穹邛茕蛩'];
var Qin		=		['亲琴秦勤芹沁覃钦禽芩寝擒'];
var Qing	=		['请轻清情青庆晴倾卿氢擎箐顷磬氰罄蜻'];


var Ran		=		['然染燃冉苒髯蚺'];
var Rang	=		['让嚷壤瓤攘穰'];
var Re		=		['热惹喏若'];
var Ren		=		['人认忍任仁刃韧壬妊荏'];
var Reng	=		['扔仍礽芿辸'];
var Ri		=		['日驲氜'];
var Rong	=		['荣容蓉融绒溶榕熔戎茸嵘'];
var Ru		=		'如入乳茹汝儒辱濡褥孺';
var Rui		=		'瑞锐睿蕊芮蕤蕤叡';
var Ruo		=		'若弱偌';
var Run		=		'润闰';
var Ruan	=		'软阮朊';


var Sa		=		'撒仨萨洒卅飒';
var Sai		=		'赛塞噻腮鳃';
var San		=		'三散伞叁';
var sang	=		'桑丧嗓搡';
var Sao		=		'扫骚嫂搔臊瘙';
var Se		=		'色涩瑟啬';
var Sen		=		'森';
var Seng	=		'僧';
var Si		=		'死四思斯似司丝私撕寺肆厮泗嘶';
var Song	=		'送松宋怂颂耸嵩诵淞讼 ';
var Su		=		'苏素速俗诉宿酥塑粟肃夙稣甦涑谡';
var Sun		=		'孙损笋隼';
var Suan	=		'算酸蒜狻';
var Sha		=		'啥傻杀沙莎纱砂煞刹鲨痧霎杉';
var Shan	=		'山删闪善扇衫珊杉姗陕膳栅煽汕擅疝鳝膻讪';
var Shang	=		'上伤商尚赏殇裳晌觞';
var Shai	=		'晒筛色';
var Shao	=		'少烧稍邵绍捎勺哨韶梢苕芍';
var Shi		=		'是诗似事式狮虱时世十师室石实使市试屎士视湿食始识失施氏示饰适释势逝噬矢誓驶弑蚀侍匙柿';
var She		=		'蛇舌射设社摄佘奢赊赦';
var Shen	=		'申伸神身深什沈肾甚审慎婶渗绅砷谂珅呻莘';
var Sheng	=		'生剩省声升胜圣绳盛晟昇甥笙牲';
var Shua	=		'刷耍唰';
var Shu		=		'树书塾数术输熟属鼠叔舒淑竖束述梳署蜀黍疏姝恕殊暑赎薯墅曙枢蔬';
var Shuan	=		'栓拴闩';
var Shuang	=		'爽双霜泷孀慡';


var Ta		=		'他她它塔踏塌榻祂沓牠拓蹋挞獭';
var Tan		=		'谈贪谭摊探叹碳坛滩痰坦潭炭毯瘫檀昙忐袒郯';
var Tang	=		'唐糖汤趟堂烫塘淌棠樘膛倘';
var Tai		=		'太台泰抬态胎钛苔肽邰';
var Tao		=		'套逃涛掏淘桃韬滔焘萄绦';
var Te		=		'特忒忑';
var Teng	=		'疼藤腾滕';
var Ti		=		'提题体踢替剃梯蹄剔啼涕缇屉媞';
var Tiao	=		'调条跳挑眺窕佻迢笤苕';
var Ting	=		'停听挺厅婷庭亭廷汀艇霆蜓';
var Tu		=		'图土吐涂兔途凸突徒屠秃荼菟';
var Tuan	=		'团疃湍団';
var Tuo		=		'拖脱托妥拓坨陀驼驮沱砣庹佗椭唾';
var Tong	=		'同通统痛桶童彤铜筒桐瞳佟僮';
var Tou		=		'头偷投透骰';

var Wa		=		'哇挖娃瓦袜蛙洼娲凹';
var Wan		=		'万完玩晚碗弯湾丸婉腕挽宛菀妄顽琬绾皖莞剜豌';
var Wang	=		'网王往忘望旺汪枉亡罔惘魍';
var Wai		=		'外歪崴';
var Wen		=		'问文雯稳吻温闻纹蚊汶瘟玟';
var Wei		=		'位为胃喂未伟玮味维卫尉威微魏巍围委尾唯薇炜苇';
var Weng	=		'翁嗡瓮滃';
var Wu		=		'吴物无误五屋午舞武务唔伍雾勿巫吾乌呜邬坞毋芜梧';
var Wo		=		'我窝喔握卧沃蜗莴龌';

var Xi		=		'细洗西溪系戏喜吸习息希茜席锡熙惜夕曦锡稀兮昔奚悉析玺汐樨';
var Xia		=		'下夏吓瞎霞虾侠峡厦辖暇匣狭瑕';
var Xian	=		'先线闲现县嫌仙限险贤咸显鲜献娴宪羡苋纤';
var Xiang	=		'想像向箱香相响项象乡祥湘翔享巷详镶厢橡襄';
var Xie		=		'写些鞋谢歇血斜卸邪泄泻蟹协屑携械谐蝎榭懈燮撷';
var Xiu		=		'修秀休绣羞袖嗅宿锈咻朽岫琇貅';
var Xiong	=		'熊凶胸兄雄匈芎汹';
var Xu		=		'许需徐旭虚续须嘘恤序绪蓄胥叙絮婿煦墟栩盱';
var Xun		=		'寻训讯熏询迅逊旬勋迅巡循薰荀驯';
var Xuan	=		'选悬轩炫玄宣萱旋璇癣喧煊瑄渲眩绚';


var Ya		=		'呀压牙亚丫雅鸭哑押芽娅崖涯鸦轧讶衙';
var Yan		=		'眼烟颜言严妍演燕艳盐炎岩研验彦延厌雁宴阎嫣焱鄢';
var Yang	=		'养羊样杨阳洋痒扬央氧仰漾秧旸鸯飏佯';
var Yao		=		'要药摇咬腰妖姚瑶耀邀尧遥窑谣夭杳';
var Ye		=		'也页爷夜业叶腋耶野液烨噎噎冶椰曳';
var Yi		=		'一以已矣意译易亿衣矣咦义依亦艺医姨宜怡益翼毅逸懿熠';
var Yin		=		'因银音印阴引隐淫瘾尹饮殷茵寅荫姻';
var Ying	=		'赢应硬英影营莹鹰颖迎映盈瑛樱婴莺萤颍荧滢';
var Yu		=		'与鱼育于雨语宇余遇玉欲羽预域俞渝瑜钰裕煜禹豫毓昱誉彧娱';
var Yun		=		'云晕运韵芸匀允蕴赟耘昀筠';
var	Yuan	=		'元袁园媛远员原院愿圆源缘圆缘苑渊';
var Yong	=		'用永勇涌拥泳咏庸雍佣蛹墉';
var You		=		'有又友由油游右优邮幽悠尤柚莜';

var Za		=		'咋砸杂扎';
var Zan		=		'赞咱攒暂簪昝瓒錾';
var Zang	=		'脏藏葬臧赃奘';
var Zai		=		'在再栽载仔宰灾崽哉';
var Zao		=		'遭枣早造澡糟燥灶皂藻';
var Ze		=		'则泽择责啧仄';
var Zen		=		'怎怎撍';
var Zeng	=		'曾增赠憎甑锃';
var Zi		=		'字子自紫资仔兹梓姿籽滋孜咨渍姊';
var Zu		=		'组租足族祖阻卒诅';
var Zui		=		'最嘴醉罪咀';
var Zun		=		'尊遵樽鳟僔';
var Zuo		=		'做坐座作左昨';
var Zuan	=		'钻赚攥';
var Zong	=		'总宗纵棕综踪粽鬃枞';
var Zha		=		'炸扎渣咋闸诈眨榨吒';
var Zhan	=		'占展粘站战沾斩詹盏蘸湛';
var Zhang	=		'张章长涨帐账掌杖胀丈璋樟障';
var Zhe		=		'这着者折哲遮浙辙喆蛰辄褶蔗';
var Zhen	=		'针真镇阵震振珍朕贞枕臻帧甄桢斟蓁箴鸩轸';
var Zheng	=		'正整郑挣证争蒸症政睁铮峥筝怔拯征徵';
var Zhi		=		'只值之至指直知纸制志支智治止致质织芝枝汁芷栀';
var Zhu		=		'住猪主祝朱煮珠助柱著筑竹株烛竺蛛褚茱';
var Zhua	=		'抓爪';
var Zhui	=		'追坠锥缀椎赘骓缒';
var Zhuo	=		'桌捉卓着拙啄灼浊酌茁濯';
var Zhun	=		'准';
var Zhuan	=		'专转赚砖篆颛';
var Zhuai	=		'拽跩';
var Zhuang	=		'装撞庄状壮妆幢桩';
var Zhong	=		'中重种钟肿忠众终仲盅冢衷';
