//****诗库*****//

//**********古诗***********//
var tang = [{
	id: '1',
	title:'《静夜思》',
	content: '床前明月光，疑是地上霜。举头望明月，低头思故乡。',
	type: 'T',
	author: {
		name: '李白',
		zhiye: '诗人',
		zuopin: '《望庐山瀑布》、《行路难》、《蜀道难》、《将进酒》、《梁甫吟》、《早发白帝城》',
		jianjie: '李白（701年2月8日—762年12月）[1]  ，字太白，号青莲居士，又号“谪仙人”。是唐代伟大的浪漫主义诗人，被后人誉为“诗仙”。与杜甫并称为“李杜”，为了与另两位诗人李商隐与杜牧即“小李杜”区别，杜甫与李白又合称“大李杜”。其人爽朗大方，爱饮酒作诗，喜交友。李白有《李太白集》传世，诗作中多以醉时写的，代表作有《望庐山瀑布》、《行路难》、《蜀道难》、《将进酒》、《梁甫吟》、《早发白帝城》等多首。'
	}

}, {
	id: '2',
	title: '《滕王阁序》',
	content: '豫章故郡，洪都新府。星分翼轸（zhěn），地接衡庐。襟三江而带五湖，控蛮荆而引瓯（ōu）越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃（fān）之榻（tà）。雄州雾列，俊采星驰。台隍（huáng）枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨（qǐ）戟（jǐ）遥临；宇文新州之懿（yì）范，襜（chān）帷（wéi）暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。 时维九月，序属三秋。潦（lǎo）水尽而寒潭清，烟光凝而暮山紫。俨（yǎn）骖（cān）騑（fēi）于上路，访风景于崇阿（ē）。临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀（tīng）凫（fú）渚（zhǔ），穷岛屿之萦回；桂殿兰宫，即冈峦之体势。 披绣闼（tà），俯雕甍（méng），山原旷其盈视，川泽纡其骇瞩。闾阎（lǘ yán）扑地，钟鸣鼎食之家；舸（gě）舰弥津，青雀黄龙之轴（通：舳zhú）。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡（lǐ）之滨，雁阵惊寒，声断衡阳之浦。 遥襟甫畅，逸兴遄（chuán）飞。爽籁发而清风生，纤歌凝而白云遏（è）。睢（suī）园绿竹，气凌彭泽之樽（zūn）；邺（yè）水朱华，光照临川之笔。四美具，二难并。穷睇眄（dì miǎn）于中天，极娱游于暇日。天高地迥（jiǒng），觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会（kuài）于云间。地势极而南溟（míng）深，天柱高而北辰远。关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍（hūn）而不见，奉宣室以何年？ 嗟乎！时运不齐，命途多舛（chuǎn）。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙（hézhé）以犹欢。北海虽赊（shē），扶摇可接；东隅（yú）已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！ 勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫（què）之长风。舍簪（zān）笏（hù）于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋（qū）庭，叨（tāo）陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？ 呜乎！胜地不常，盛筵难再；兰亭已矣，梓（zǐ）泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔： 滕王高阁临江渚，佩玉鸣鸾罢歌舞。 画栋朝飞南浦云，珠帘暮卷西山雨。 闲云潭影日悠悠，物换星移几度秋。 阁中帝子今何在？槛外长江空自流。',
	type: 'T',
	author: {
		name: '王勃',
		zhiye: '作家',
		zuopin: '《滕王阁序》',
		jianjie: '王勃（约650年—约676年），字子安，汉族，唐代诗人。古绛州龙门（今山西河津）人，出身儒学世家，与杨炯、卢照邻、骆宾王并称为“初唐四杰”，王勃为四杰之首。王勃自幼聪敏好学，据《旧唐书》记载，他六岁即能写文章，文笔流畅，被赞为“神童”。九岁时，读颜师古注《汉书》，作《指瑕》十卷以纠正其错。十六岁时，应幽素科试及第，授职朝散郎。因做《斗鸡檄》被赶出沛王府。之后，王勃历时三年游览巴蜀山川景物，创作了大量诗文。返回长安后，求补得虢州参军。在参军任上，因私杀官奴二次被贬。上元三年（676年）八月，自交趾探望父亲返回时，不幸渡海溺水，惊悸而死。王勃在诗歌体裁上擅长五律和五绝，代表作品有《送杜少府之任蜀州》，主要文学成就是骈文，无论是数量还是质量上，都是上乘之作，代表作品有《滕王阁序》等。'
	}
}, {
	id: '3',
	title: '《芙蓉楼送辛渐》',
	content: '寒雨连江夜入吴，平明送客楚山孤。洛阳亲友如相问，一片冰心在玉壶。',
	type: 'T',
	author: {
		name: '王昌龄',
		zhiye: '诗人',
		zuopin: '《芙蓉楼送辛渐》《出塞》《从军行》《塞下曲》',
		jianjie: '王昌龄 (698— 756），字少伯，汉族，河东晋阳（今山西太原）人，又一说京兆长安人（今西安）人。盛唐著名边塞诗人，后人誉为“七绝圣手”。早年贫贱，困于农耕，年近而立，始中进士。初任秘书省校书郎，又中博学宏辞，授汜水尉，因事贬岭南。与李白、高适、王维、王之涣、岑参等交厚。开元末返长安，改授江宁丞。被谤谪龙标尉。安史乱起，为刺史闾丘晓所杀。其诗以七绝见长，尤以登第之前赴西北边塞所作边塞诗最著，有“诗家夫子王江宁”之誉。王昌龄诗绪密而思清，与高适、王之涣齐名，时谓王江宁。集六卷，今编诗四卷。'
	}
}];

//**********古词***********//
var song = [{
	id: '1',
	title: '《青玉案.元夕》',
	content: '东风夜放花千树⑶，更吹落，星如雨⑷。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。',
	type: 'S'
}];
//**********单句名句**********//
var dan = [{
	id:'1',
	title:'《论语·里仁》',
	content:'1.子曰：“里仁为美。择不处仁，焉得知？”子曰：“不仁者不可以久处约，不可以长处乐。仁者安仁，知者利仁。”子曰：“唯仁者能好人，能恶人。”子曰：“苟志于仁矣，无恶也。”子曰：“富与贵，是人之所欲也；不以其道得之，不处也。贫与贱，是人之所恶也；不以其道得之，不去也。君子去仁，恶乎成名？君子无终食之间违仁，造次必于是，颠沛必于是。”子曰：“我未见好仁者，恶不仁者。好仁者，无以尚之；恶不仁者，其为仁矣，不使不仁者加乎其身。有能一日用其力于仁矣乎？我未见力不足者。盖有之矣，我未之见也。”子曰：“人之过也，各于其党。观过，斯知仁矣。”子曰：“朝闻道，夕死可矣。”子曰：“士志于道，而耻恶衣恶食者，未足与议也。”子曰：“君子之于天下也，无适也，无莫也，义之与比。”子曰：“君子怀德，小人怀土；君子怀刑，小人怀惠。”子曰：“放于利而行，多怨。”子曰：“能以礼让为国乎？何有？不能以礼让为国，如礼何？”子曰：“不患无位，患所以立；不患莫已知，求为可知也。”子曰：“参乎！吾道一以贯之。”曾子曰：“唯。”子出，门人问曰：“何谓也？”曾子曰：“夫子之道，忠恕而已矣。”子曰：“君子喻于义，小人喻于利。”子曰：“见贤思齐焉，见不贤而内自省也。”子曰：“事父母几谏，见志不从，又敬不违，劳而不怨。”子曰：“父母在，不远游，游必有方。”子曰：“三年无改于父之道，可谓孝矣。”子曰：“父母之年，不可不知也。一则以喜，一则以惧。”子曰：“古者言之不出，耻躬之不逮也。”子曰：“以约失之者鲜矣。”子曰：“君子欲讷于言而敏于行。”子曰：”德不孤，必有邻。“子游曰：“事君数，斯辱矣；朋友数，斯疏矣。”',
	type:'D'
}];